const TelegramBot = require('node-telegram-bot-api');

const token = '6131342392:AAHdWkFnpEZqsgkHokdEyins8lsJfYVJsSw';

const bot = new TelegramBot(token, { polling: true });

bot.onText(/\/start|\/help/, (msg) => {
    const chatId = msg.chat.id;

    bot.sendMessage(chatId, `<b>\u26A1 Привіт! Я - твій помічник по пошуку інформації про симулятор Elliensvision SC. Вибери одну з наступних опцій</b> \u2764\uFE0F\u200D\uD83D\uDD25`, {
        parse_mode: 'HTML',
        reply_markup: {
            keyboard: [
                ['Лист обміну', 'Правила'],
                ['Основна інформація']
            ],
            resize_keyboard: true
        }
    });
});

const escapeHtml = (text) => {
    const entities = {
        '&': '&amp;',
        '<': '&lt;',
        '>': '&gt;',
        '"': '&quot;',
        "'": '&#39;',
    };
    return text.replace(/[&<>"']/g, (entity) => entities[entity]);
};

bot.onText(/Лист обміну/, (msg) => {
    const chatId = msg.chat.id;

    bot.sendMessage(chatId, '<b>— ЛИСТ ОБМІНУ —</b>\n\n<b>— Країни Європи:</b>\n<i>Іспанія - Португалія - Андорра</i>\n<i>Великобританія - Гернсі - Гібралтар - Острів Мен</i>\n<i>Франція - Монако - Марокко</i>\n<i>Нідерланди - Бельгія - Люксембург</i>\n<i>Німеччина - Австрія - Ліхтенштейн</i>\n<i>Італія - Сан-Марино - Мальта</i>\n<i>Словенія - Хорватія - Боснія та Герцеговина</i>\n<i>Албанія - Чорногорія - Північна Македонія - Косово</i>\n<i>Греція - Кіпр</i>\n<i>Чехія - Словаччина</i>\n<i>Литва - Латвія - Естонія</i>\n<i>Швеція - Аландські острови</i>\n<i>Румунія - Молдова</i>\n\n<b>— Країни Азії:</b>\n<i>Туреччина - Азербайджан</i>\n<i>Казахстан - Таджикистан - Узбекистан - Киргизстан - Туркменистан - Афганістан</i>\n<i>Китай - Тайвань - Монголія</i>\n<i>Непал - Бутан - Індія</i>\n<i>Бангладеш - Пакистан</i>\n<i>М\'янма - Лаос - В\'єтнам - Таїланд</i>\n\n<b>— Країни Океанії:</b>\n<i>Австралія - Нова Зеландія - Папуа-Нова Гвінея - Палау - Самоа</i>\n\n<b>— Країни Північної Америки:</b>\n<i>США - Американське Самоа - Пуерто-Рико - Маршаллові острови - ФШ Мікронезії</i>\n<i>Мексика - Панама - Гондурас - Беліз</i>\n\n<b>— Країни Південної Америки:</b>\n<i>Бразилія - Болівія - Уругвай</i>\n<i>Аргентина - Чилі</i>\n<i>Колумбія - Венесуела - Еквадор - Суринам</i>', {
        parse_mode: 'HTML'
    });
});

bot.onText(/Правила/, (msg) => {
    const chatId = msg.chat.id;

    bot.sendMessage(chatId, '<b>— ПРАВИЛА КОНКУРСУ —</b>\n\n\n<b>— Правила вибору пісні:</b>\n\n• Пісня має бути випущеною після 1 січня 2016 року\n• Перегляди офіційного кліпу на платформі YouTube не мають перевищувати 100 мільйонів\n• Заборонені пісні з ліцензією WMG\n• Заборонені пісні з Євробачення\n• Дозволені пісні з національних відборів на Євробачення\n• Пісня може бути виконана на будь якій мові світу\n\n<b>— Правила вибору країни:</b>\n\n• Країна має бути повністю признаною асамблеєю ООН та мати участь в міжнародних корпораціях\n• Росія, Білорусь, Північна Корея та Іран є забороненими країнами на нашому симуляторі за спонсорування та створення агресивної війни проти України\n• Можна обрати від 1 до 3 країн на одного куратора\n• Заборонено давати бали своїм країнам \n\n<b>— Правила вибору виконавця:</b>\n\n• Виконавець має бути громадянином країни, яку він буде представляти, або ж мати національні корні\n• Якщо виконавець в реальному житті займається нелегалом або ж підтримує любе насильство та війни (торгівля наркотиками, війна в Україні), він є автодискваліфікованим\n• Виконавець не має мати різні порушення та недоговірності з компанією відеохостингу YouTube', {
        parse_mode: 'HTML'
    });
});

bot.onText(/Основна інформація/, (msg) => {
    const chatId = msg.chat.id;

    bot.sendMessage(chatId, '<b>— ОСНОВНА ІНФОРМАЦІЯ —</b>\n\n• Симулятор був створений @kirilkisnichan. Любі питання в особисті повідомлення, а не в бот.\n• Ми - якісний та проукраїнський симулятор. \n• Для участі дозволені всі країни світу, окрім ЧС.\n• Наша таблиця є ізюминкою симулятору. Вона схожа на скорборд зі справжнього Євробачення.\n• Розкритий лист обміну.\n• Справедливі правила.\n\n\u26A1\u2764\uFE0F\u200D\uD83D\uDD25 <i>Ця інформація створена для нових учасників симулятору. Посилання на конкурс - @elliensvisionofficial</i>', {
        parse_mode: 'HTML'
    });
});